Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/enforcement_and_redress/index.html.txt.tmx
Source language: en
Languages: ga

source: Overview Document Overview of employment rights enforcement Summary of the bodies that assist employees to enforce their employment rights
ga: Overview Document Cur i bhfeidhm do chearta fostaíochta Achoimre na comhlachtaí éagsúla a gcabhraíonn le fostaí a gcearta fostaíochta a chur i bhfeidhm

source: Employment rights legislation: inspection and compliance
ga: Reachtaíocht um chearta fostaíochta: iniúchadh agus comhlíonadh

source: The Inspection and Enforcement Services of the Workplace Relations Commission aim to ensure compliance with employment rights legislation
ga: Tá sé mar aidhm ag na Seirbhísí Cigireachta agus Ionchúisimh an Choimisiúin um Chaidreamh san Áit Oibre comhlíonadh le reachtaíocht um chearta fostaíochta a dhaingniú

source: Adjudication of employment rights disputes and complaints
ga: Breithniúchán na ndíospóidí agus na ngearán faoi chearta fostaíochta

source: Adjudication officers investigate disputes, grievances and claims that individuals or small groups of workers make under certain employment legislation
ga: Déanann oifigí breithniúcháin imscrúdú ar dhíospóidí, casaoidí agus éilimh a thugann daoine aonair nó grúpaí oibrithe beaga faoi reachtaíocht fostaíochta áirithe

source: Appealing a decision to the Labour Court
ga: Achomharc a dhéanamh chuig an gCúirt Oibreachais

source: Since 1 October 2015, the Labour Court is the single appeal body for all workplace relations appeals
ga: Ó 1 Meán Fómhair 2015, is í an Chúirt Oibreachais an t-aon fhoras achomhairc amháin maidir le hachomhairc chaidrimh san ionad oibre

source: Disputes about equality and discrimination
ga: Díospóidí maidir le comhionannas agus idirdhealú

source: The Workplace Relations Commission deals with all complaints of discrimination in employment and access to goods and services which come under equality legislation
ga: Déileálann an Coimisiún um Chaidreamh san Áit Oibre le gach gearán a bhaineann le hidirdhealú san fhostaíocht agus i rochtain ar earraí agus seirbhísí faoi reachtaíocht comhionannais

source: Some employment legislation protects you from being victimised at work
ga: Tá roinnt reachtaíochta fostaíochta ann a thugann cosaint duit ó íospairt san ionad oibre

source: Workplace mediation provides a simpler and faster way to resolve disputes, conflicts and disagreements in the workplace
ga: Soláthraíonn idirghabháil sa láithair oibre bealach níos simplí agus níos tapúla chun aighnis, coimhlintí agus easaontuithe san ionad oibre a réiteach

source: The Workplace Relations Commission handles all industrial relations and employment law disputes
ga: Déileálann an Coimisiún um Chaidreamh san Áit Oibre gach díospóid faoi chaidreamh san ionad oibre agus faoi dhlíthe fostaíochta

source: People who raise concerns about possible wrongdoing in the workplace are protected by the Protected Disclosures Act 2014
ga: Tá daoine a thugann buarthaí chun solais faoi éagóir fhéideartha san áit oibre faoi chosaint ag an Acht um Nochtadh Cosanta, 2014

source: Department of Jobs, Enterprise and Innovation
ga: An Roinn Post, Fiontar, agus Nuálaíochta

source: The Department of Jobs, Enterprise and Innovation is responsible for implementing Government policy in a number of areas including the protection of workers
ga: Tá an Roinn Post, Fiontair agus Fostaíochta freagrach as beartas rialtais a chur i bhfeidhm i réimsí éagsúla lena n-áirítear cosaint na bhfostaithe

source: Most Read in "Employment"
ga: Ábhar is mó éilimh i "Fostaíocht"

source: Rest periods and breaks
ga: Tréimhsí sosa agus sosanna

source: Tax and starting work - PAYE
ga: Gnó a chur ar bun
